InformationRegisters/СвязанныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеРаботы</Name>
			<Comment>Связанные работы и детали для авторабот</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидНормировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_СложностьРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_СложностьРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OPERACODV2_ВидРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OPERACODE_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьДанныеВЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетДляКомплектации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормыРасходаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/PackageCode/Ext/Module.bsl
Функция PackageCodeGet(PackageCodeGetRequest)
	// Вставить содержимое обработчика.
	PackageCodeGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PackageCodeGetResponse");
	PackageCodeGet = ФабрикаXDTO.Создать(PackageCodeGetType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));

	Попытка
		КодПакета = PackageCodeGetRequest.PackageCodeGet.Code;
	Исключение
		КодПакета = "";
	КонецПопытки;       
	Попытка
		Описание = PackageCodeGetRequest.PackageCodeGet.Description;
	Исключение
		Описание = "";
	КонецПопытки;     
    Попытка
		Модель = PackageCodeGetRequest.PackageCodeGet.ModelCode;
	Исключение
		Модель = "";
	КонецПопытки; 
    Попытка
		Двигатель = PackageCodeGetRequest.PackageCodeGet.EngineCode;
	Исключение
		Двигатель = "";
	КонецПопытки;     
    Попытка
		Пробег = PackageCodeGetRequest.PackageCodeGet.Mileage;
	Исключение
		Пробег = "";
	КонецПопытки;   	
	Попытка
		НачДатаИзменения = PackageCodeGetRequest.PackageCodeGet.LastModifiedDateTimeFromUTC;
	Исключение
		НачДатаИзменения = Дата('00010101');
	КонецПопытки;   
	Попытка
		КонДатаИзменения = PackageCodeGetRequest.AppointmentGet.LastModifiedDateTimeToUTC;
	Исключение
		КонДатаИзменения = Дата('00010101');
	КонецПопытки;

	МодельСсылка = Справочники.Модели.ПустаяСсылка();
	ПакетСсылка = Справочники.Автоработы.ПустаяСсылка();
	Если ЗначениеЗаполнено(Модель) Тогда
		МодельСсылка = Справочники.Модели.НайтиПоКоду(Модель);
		Если обЗначениеНеЗаполнено(МодельСсылка) Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PCG03";
			НоваяСтрока.ТекстОшибки = "Модель с указанным кодом не найдена";
			PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"-1",ТаблицаОщибок);
			Возврат PackageCodeGet;      
		КонецЕсли;		
	ИначеЕсли ЗначениеЗаполнено(КодПакета) Тогда
		ПакетСсылка = Справочники.Автоработы.НайтиПоКоду(КодПакета);
		Если обЗначениеНеЗаполнено(ПакетСсылка) Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PCG03";
			НоваяСтрока.ТекстОшибки = "Авторабота с указанным кодом не найдена";
			PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"-1",ТаблицаОщибок);
			Возврат PackageCodeGet;      
		КонецЕсли;
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PCG03";
		НоваяСтрока.ТекстОшибки = "Не заполено ни одно из обязательных полей для поиска";
		PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"-1",ТаблицаОщибок);
		Возврат PackageCodeGet;      		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Двигатель) Тогда 
		ДвигательСсылка = Справочники.ТипыДвигателей.НайтиПоКоду(Двигатель);
		Если обЗначениеНеЗаполнено(ДвигательСсылка) Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PCG04";
			НоваяСтрока.ТекстОшибки = "Тип двигателя с указанным кодом не найден";
			PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"-1",ТаблицаОщибок);
			Возврат PackageCodeGet;      
		КонецЕсли;
	Иначе
		ДвигательСсылка = Справочники.ТипыДвигателей.ПустаяСсылка();
	КонецЕсли;
	
    // БЛОК ПОИСКА
	//СписокВерсионирование = Новый СписокЗначений;
	//Если ЗначениеЗаполнено(НачДатаИзменения) ИЛИ ЗначениеЗаполнено(КонДатаИзменения) Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	Версионирование.Идентификатор КАК ДокСсылка,
	//	               |	Версионирование.ПредставлениеМетаданных,
	//	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Версионирование.Автор) КАК Автор
	//	               |ИЗ
	//	               |	РегистрСведений.Версионирование КАК Версионирование
	//	               |ГДЕ
	//	               |	Версионирование.ДатаИзменения МЕЖДУ &ДатаНач И &ДатаКон
	//	               |	И Версионирование.ПредставлениеМетаданных = &СправочникАвтоработы
	//				   |СГРУППИРОВАТЬ ПО
	//	               |	Версионирование.Идентификатор,                                               
	//	               |	Версионирование.ПредставлениеМетаданных";

	//	Если обЗначениеНеЗаполнено(НачДатаИзменения) Тогда
	//		Запрос.Параметры.Вставить("ДатаНач",Дата('20150501'));
	//	Иначе
	//		Запрос.Параметры.Вставить("ДатаНач",НачДатаИзменения);
	//	КонецЕсли;		
	//	Если обЗначениеНеЗаполнено(КонДатаИзменения) Тогда
	//		Запрос.Параметры.Вставить("ДатаКон",Дата('20300101'));
	//	Иначе
	//		Запрос.Параметры.Вставить("ДатаКон",КонДатаИзменения);
	//	КонецЕсли;   
	//	Запрос.Параметры.Вставить("СправочникАвтоработы","Справочник.Автоработы"); 
	//	
	//	Выб = Запрос.Выполнить().Выбрать();
	//	Пока Выб.Следующий() Цикл
	//		СписокВерсионирование.Добавить(Справочники.Автоработы.ПолучитьСсылку(Выб.ДокСсылка));
	//	КонецЦикла;		
	//КонецЕсли;    

	// Тип двигателя - в Модели обязательный реквизит! Есть реквизит Тип работ в Автоработе - признак Пакета!
    Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ПустойТипДвигателя", Справочники.ТипыДвигателей.ПустаяСсылка());
	ОтборПоТипуДвигателя = "И ВЫБОР
		               |		КОГДА АвтоработыНормыВремени.ВариантКомплектации ЕСТЬ NULL
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ АвтоработыНормыВремени.ВариантКомплектации.ТипДвигателя = &ДвигательСсылка
		               |	КОНЕЦ";
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтоработыНормыВремени.Ссылка КАК ПакетСсылка,
	               |	АвтоработыНормыВремени.Ссылка.Код КАК КодПакета,
	               |	АвтоработыНормыВремени.Ссылка.Наименование КАК НаименованиеПакета,
	               |	АвтоработыНормыВремени.Ссылка.ТипРабот КАК ТипПакета,
	               |	АвтоработыНормыВремени.Ссылка.ВремяВыполнения КАК ВремяВыполнения,
	               |	АвтоработыНормыВремени.Модель КАК МодельСсылка,
	               |	ВЫБОР
	               |		КОГДА АвтоработыНормыВремени.ВариантКомплектации ЕСТЬ NULL
	               |			ТОГДА &ПустойТипДвигателя
	               |		ИНАЧЕ АвтоработыНормыВремени.ВариантКомплектации.ТипДвигателя
	               |	КОНЕЦ КАК ТипДвигателя
	               |ИЗ
	               |	Справочник.Автоработы.НормыВремени КАК АвтоработыНормыВремени
	               |ГДЕ
	               |	НЕ АвтоработыНормыВремени.Ссылка.ПометкаУдаления
	               |	" + ?(ЗначениеЗаполнено(МодельСсылка), "И АвтоработыНормыВремени.Модель = &МодельСсылка", "") + "
                   |	" + ?(ЗначениеЗаполнено(ПакетСсылка), "И АвтоработыНормыВремени.Ссылка = &ПакетСсылка", "") + "
	               |    " + ?(ЗначениеЗаполнено(ДвигательСсылка), ОтборПоТипуДвигателя, "") + "
				   |
	               |ИТОГИ ПО
	               |	ПакетСсылка";
	
	Если ЗначениеЗаполнено(МодельСсылка) Тогда
		Запрос.Параметры.Вставить("МодельСсылка", МодельСсылка);
	КонецЕсли;  
	Если ЗначениеЗаполнено(ПакетСсылка) Тогда
		Запрос.Параметры.Вставить("ПакетСсылка", ПакетСсылка);
	КонецЕсли;  
	Если ЗначениеЗаполнено(ДвигательСсылка) Тогда
		Запрос.Параметры.Вставить("ДвигательСсылка", ДвигательСсылка);
	КонецЕсли; 
	//Если СписокВерсионирование.Количество()>0 Тогда
	//	Запрос.Параметры.Вставить("СписокВерсионирование",СписокВерсионирование);
	//КонецЕсли;   
		
	ВыборкаПакеты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Если ВыборкаПакеты.Количество() = 0 Тогда                         		
		PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"0",ТаблицаОщибок);
		Возврат PackageCodeGet;  	
		
	Иначе           				
		ЗапросРаботы = Новый Запрос;
		ЗапросРаботы.Текст = "ВЫБРАТЬ
		               |	СвязанныеРаботы.СвязаннаяРабота КАК РаботаСсылка,
		               |	СвязанныеРаботы.СвязаннаяРабота.Код КАК КодРаботы,
		               |	СвязанныеРаботы.СвязаннаяРабота.Наименование КАК НаименованиеРаботы,
		               |	СвязанныеРаботы.СвязаннаяРабота.Артикул КАК АртикулРаботы,
		               |	СвязанныеРаботы.СвязаннаяРабота.ВремяВыполнения КАК ВремяВыполнения,
		               |	СвязанныеРаботы.Цена ЦенаРаботы,
		               |	СвязанныеРаботы.Количество КАК КоличествоРаботы
		               |ИЗ
		               |	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
		               |ГДЕ
		               |	СвязанныеРаботы.Авторабота = &ПакетСсылка
		               |	И СвязанныеРаботы.СвязаннаяРабота ССЫЛКА Справочник.Автоработы";
		
		ЗапросНоменклатура = Новый Запрос;
		ЗапросНоменклатура.Текст = "ВЫБРАТЬ
		               |	СвязанныеРаботы.СвязаннаяРабота КАК НоменклатураСсылка,
		               |	СвязанныеРаботы.СвязаннаяРабота.Код КАК КодНоменклатуры,
		               |	СвязанныеРаботы.СвязаннаяРабота.Наименование КАК НаименованиеНоменклатуры,
		               |	СвязанныеРаботы.СвязаннаяРабота.Артикул КАК АртикулНоменклатуры,
		               |	СвязанныеРаботы.СвязаннаяРабота.ОсновнаяЕдиницаИзмерения КАК ЕдИзмНоменклатуры,
		               |	СвязанныеРаботы.Цена ЦенаНоменклатуры,
		               |	СвязанныеРаботы.Количество КАК КоличествоНоменклатуры
		               |ИЗ
		               |	РегистрСведений.СвязанныеРаботы КАК СвязанныеРаботы
		               |ГДЕ
		               |	СвязанныеРаботы.Авторабота = &ПакетСсылка
		               |	И СвязанныеРаботы.СвязаннаяРабота ССЫЛКА Справочник.Номенклатура";
			
		PackageCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "ArrayOfPackageCode");
		PackageCodes = ФабрикаXDTO.Создать(PackageCodesType); 	
		PackageCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PackageCode");       		
		Пока ВыборкаПакеты.Следующий() Цикл
			PackageCode = ФабрикаXDTO.Создать(PackageCodeType);		
			PackageCode.Code = ВыборкаПакеты.КодПакета;
			PackageCode.Description = ВыборкаПакеты.НаименованиеПакета;
			Если ВыборкаПакеты.ТипПакета = Перечисления.ТипыРабот.ТО Тогда
				PackageCode.PackageCodeType = "2";
			Иначе
				PackageCode.PackageCodeType = "3";
			КонецЕсли;
			PackageCode.DisplayPackageCode = ВыборкаПакеты.КодПакета;
			PackageCode.DisplayOperationDescription = ВыборкаПакеты.НаименованиеПакета;
			PackageCode.Make = "";
						
			ВыборкаМодели = ВыборкаПакеты.Выбрать();
			Если ВыборкаМодели.Следующий() И ЗначениеЗаполнено(ВыборкаМодели.МодельСсылка) Тогда
				МодельПакета = ВыборкаМодели.МодельСсылка;
				PackageCode.ModelCode = МодельПакета.КодМодели;	
				PackageCode.Model = МодельПакета.Наименование;
				Если ЗначениеЗаполнено(ВыборкаМодели.ТипДвигателя) Тогда
					PackageCode.EngineCode = ВыборкаМодели.ТипДвигателя.Код;
					PackageCode.Engine = ВыборкаМодели.ТипДвигателя.Наименование;			
				Иначе
					PackageCode.EngineCode = "";
					PackageCode.Engine = "";			
				КонецЕсли;
			Иначе
				МодельПакета = Справочники.Модели.ПустаяСсылка();
				PackageCode.ModelCode = "";	
				PackageCode.Model = "";
				PackageCode.EngineCode = "";
				PackageCode.Engine = "";							
			КонецЕсли;		
			
			PackageCode.Year = "";
			PackageCode.Mileage = "15000";
			PackageCode.Period = "";
			PackageCode.DefLinePaymentMethod = ""; 						
			PackageCode.EstimatedHours = Формат(ВыборкаПакеты.ВремяВыполнения, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");

			//ПерваяЗапись = РегистрыСведений.Версионирование.ПолучитьПервое(,Новый Структура("Идентификатор, ПредставлениеМетаданных",ВыборкаПакеты.Ссылка.УникальныйИдентификатор(),ВыборкаПакеты.Ссылка.Метаданные().ПолноеИмя()));
			//ПоследняяЗапись = РегистрыСведений.Версионирование.ПолучитьПоследнее(,Новый Структура("Идентификатор, ПредставлениеМетаданных",ВыборкаПакеты.Ссылка.УникальныйИдентификатор(),ВыборкаПакеты.Ссылка.Метаданные().ПолноеИмя()));
			ManagementFieldsDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "ManagementFields");
			ManagementFieldsData = ФабрикаXDTO.Создать(ManagementFieldsDataType); 
			ПерваяЗапись = ТекущаяДата();
			ПоследняяЗапись = ТекущаяДата();
			ManagementFieldsData.CreateDateTimeUTC = ПерваяЗапись;
			ManagementFieldsData.LastModifiedDateTimeUTC = ПоследняяЗапись;
			PackageCode.ManagementFields = ManagementFieldsData;
			
			//PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PriceType");
			//Price = ФабрикаXDTO.Создать(PriceType);
			//Если ЗначениеЗаполнено(МодельПакета) Тогда
			//	НормочасЦенаСтр = орПолучитьЦенуАвтоработы(Справочники.ТипыЦен.ОсновнойТипЦенПродажи, ВыборкаПакеты.ПакетСсылка, МодельПакета,
			//					Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка(), Справочники.Цеха.ПустаяСсылка(), Справочники.ВидыРемонта.ПустаяСсылка());
			//	ЦенаПакета = Формат(НормочасЦенаСтр.Цена * ВыборкаПакеты.ВремяВыполнения, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
			//	Price.UnitPrice = ЦенаПакета;
			//	Price.TotalPrice = ЦенаПакета;
			//	Price.TotalPriceIncludeTax = ЦенаПакета;
			//	Price.DiscountRate = "0";
			//	Price.DiscountPrice = "0";  
			//КонецЕсли;          
			//PackageCode.PriceType = Price;
			
			// связанные работы
			ЗапросРаботы.Параметры.Вставить("ПакетСсылка", ВыборкаПакеты.ПакетСсылка);
			ВыборкаРаботы = ЗапросРаботы.Выполнить().Выбрать();
			НетРабот = ВыборкаРаботы.Количество() = 0;
			OpCodesType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "ArrayOfOPCode");
			OpCodes = ФабрикаXDTO.Создать(OpCodesType);
            OPCodeType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "OPCode");			
			Пока ВыборкаРаботы.Следующий() Цикл
				OpCode = ФабрикаXDTO.Создать(OPCodeType); 
				OpCode.Code = ВыборкаРаботы.КодРаботы;
				OpCode.Description = ВыборкаРаботы.НаименованиеРаботы;
				OpCode.OPCodeType = ?(ВыборкаРаботы.КодРаботы = ВыборкаРаботы.АртикулРаботы, "1", "2");
				OpCode.DisplayOPCode = ВыборкаРаботы.КодРаботы;
				OpCode.DisplayOPDescription = ВыборкаРаботы.НаименованиеРаботы;
				OpCode.Make = "";
				OpCode.Model = "";			
				OpCode.Engine = "";
				OpCode.Year = "";
				OpCode.Mileage = "";
				OpCode.Period = "";
				OpCode.Quantity = Формат(ВыборкаРаботы.КоличествоРаботы, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
				OpCode.DefLinePaymentMethod = "";
				OpCode.CorrectionLOP = "";
				OpCode.SkillLevel = "";			
				OpCode.HazardMaterialCharge = "";					
				OpCode.EstimatedHours = Формат(ВыборкаРаботы.ВремяВыполнения, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
				OpCode.PredefinedCauseDescription = "";
				OpCode.CPSIND = "";  	
				OpCode.MandatoryYN = "";  

				PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PriceType");
				Price = ФабрикаXDTO.Создать(PriceType);
				Если ЗначениеЗаполнено(ВыборкаРаботы.ЦенаРаботы) Тогда
					ЦенаСвРаботы = Формат(ВыборкаРаботы.ЦенаРаботы, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
					Price.UnitPrice = ЦенаСвРаботы;
					Price.TotalPrice = ЦенаСвРаботы;
					Price.TotalPriceIncludeTax = ЦенаСвРаботы;
				Иначе
					Если ЗначениеЗаполнено(МодельПакета) Тогда
						НормочасЦенаСтр = орПолучитьЦенуАвтоработы(Справочники.ТипыЦен.ОсновнойТипЦенПродажи, ВыборкаРаботы.РаботаСсылка, МодельПакета,
										Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка(), Справочники.Цеха.ПустаяСсылка(), Справочники.ВидыРемонта.ПустаяСсылка());
						ЦенаСвРаботы = Формат(НормочасЦенаСтр.Цена * ВыборкаРаботы.ВремяВыполнения, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
						Price.UnitPrice = ЦенаСвРаботы;
						Price.TotalPrice = ЦенаСвРаботы;
						Price.TotalPriceIncludeTax = ЦенаСвРаботы;
						Price.DiscountRate = "0";
						Price.DiscountPrice = "0";  
					КонецЕсли;          
				КонецЕсли;				
				Price.DiscountRate = "0";
				Price.DiscountPrice = "0";  
				OpCode.PriceType = Price;
				
				PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "ArrayOfPart");
				Parts = ФабрикаXDTO.Создать(PartsType);
                OpCode.Parts = Parts;     									  							
                OpCodes.OpCode.Добавить(OpCode);     
			КонецЦикла; 
			
			// связанная номенклатура
			OpCode = ФабрикаXDTO.Создать(OPCodeType); 
			OpCode.Code = "OP_Part";
			OpCode.Description = "";
			OpCode.OPCodeType = "";
			OpCode.DisplayOPCode = "";
			OpCode.DisplayOPDescription = "";
			OpCode.Make = "";
			OpCode.Model = "";			
			OpCode.Engine = "";
			OpCode.Year = "";
			OpCode.Mileage = "";
			OpCode.Period = "";
			OpCode.Quantity = Формат(0,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
			OpCode.DefLinePaymentMethod = "";
			OpCode.CorrectionLOP = "";
			OpCode.SkillLevel = "";			
			OpCode.HazardMaterialCharge = "";					
			OpCode.EstimatedHours = Формат(0,"ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
			OpCode.PredefinedCauseDescription = "";
			OpCode.CPSIND = "";  	
			OpCode.MandatoryYN = "";  
			
			PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PriceType");
			Price = ФабрикаXDTO.Создать(PriceType);
			OpCode.PriceType = Price;
			
			PartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "ArrayOfPart");
			Parts = ФабрикаXDTO.Создать(PartsType);
			
			ЗапросНоменклатура.Параметры.Вставить("ПакетСсылка", ВыборкаПакеты.ПакетСсылка);
			ВыборкаНоменклатура = ЗапросНоменклатура.Выполнить().Выбрать();
			НетЗапчастей = ВыборкаНоменклатура.Количество() = 0;
			Если НетРабот И НетЗапчастей Тогда
				Продолжить;
			КонецЕсли;
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				PartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "Part");
				Part = ФабрикаXDTO.Создать(PartType);
				Part.Manufacturer = "";
				Part.PartNumber = ВыборкаНоменклатура.АртикулНоменклатуры; 
				Part.PartDescription = ВыборкаНоменклатура.НаименованиеНоменклатуры; 
				Part.Make = "";
				Part.PartStatus = "";
				Part.PartType = ?(ВыборкаНоменклатура.КодНоменклатуры = ВыборкаНоменклатура.АртикулНоменклатуры, "1", "2");
				
				Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
				КодДилера = PackageCodeGetRequest.TransactionHeader.DealerID;
				Если КодДилера = "RC294" Тогда // исправить на RC294 в рабочей базе
					Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001175");
				ИначеЕсли КодДилера = "RC536" Тогда
					Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001258");
				КонецЕсли;				
				Если ЗначениеЗаполнено(Подразделение) Тогда
					ЗапросЦеныОстатки = Новый Запрос;
					ЗапросЦеныОстатки.Текст = "ВЫБРАТЬ
					               |	ВЫБОР
					               |		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL
					               |			ТОГДА 0
					               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)
					               |	КОНЕЦ КАК СвободныйОстаток,
					               |	ЦеныСрезПоследних.Цена КАК Цена
					               |ИЗ
					               |	РегистрСведений.Цены.СрезПоследних(
					               |			,
					               |			Номенклатура = &Номенклатура
					               |				И ПодразделениеКомпании = &Подразделение
					               |				И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
					               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
					               |				,
					               |				СкладКомпании.Подразделение = &Подразделение
					               |					И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
					               |		ПО ЦеныСрезПоследних.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура";
																							 
					ЗапросЦеныОстатки.Параметры.Вставить("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
					ЗапросЦеныОстатки.Параметры.Вставить("Номенклатура", ВыборкаНоменклатура.НоменклатураСсылка);
					ЗапросЦеныОстатки.Параметры.Вставить("Подразделение", Подразделение);

					ВыборкаЦены = ЗапросЦеныОстатки.Выполнить().Выбрать();
					Если ВыборкаЦены.Следующий() Тогда
						UnitPrice = ВыборкаЦены.Цена;
						Part.QuantityOnHand = Формат(ВыборкаЦены.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0");
						Part.StockQuantity = ?(ВыборкаЦены.СвободныйОстаток > 0, "Y", "N");			
						Part.StockStatus = Формат(ВыборкаЦены.СвободныйОстаток, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0");					
					Иначе        		
						UnitPrice = 0;
						Part.QuantityOnHand = "0";
						Part.StockQuantity = "N";
						Part.StockStatus = "";
					КонецЕсли;  					
				Иначе
					UnitPrice = 0;
					Part.QuantityOnHand = "0";
					Part.StockQuantity = "N";
					Part.StockStatus = "";
				КонецЕсли;
					
				Part.DisplayPartNumber = ВыборкаНоменклатура.АртикулНоменклатуры; 
				Part.Remarks = "";    					
				Part.UnitOfMeasure = ВыборкаНоменклатура.ЕдИзмНоменклатуры.Наименование;
				Part.Quantity = Формат(ВыборкаНоменклатура.КоличествоНоменклатуры, "ЧЦ=7; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Part.ServiceType = ""; 
				Part.DisplayRemarks = "";
				Part.MandatoryYN = "";

				PriceType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PackageCodeGetRequest", "PriceType");
				Price = ФабрикаXDTO.Создать(PriceType);				
				Price.UnitPrice = Формат(UnitPrice, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Price.TotalPrice = Формат(UnitPrice * ВыборкаНоменклатура.КоличествоНоменклатуры, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				Price.TotalPriceIncludeTax = Price.TotalPrice;
				Price.DiscountRate = "0";
				Price.DiscountPrice = "0";  
				Part.PriceType = Price;   										         
	
                Parts.Part.Добавить(Part);
			КонецЦикла;   			
			
			OpCode.Parts = Parts;     									  							
            OpCodes.OpCode.Добавить(OpCode);     					
			PackageCode.OpCodes = OpCodes;
			PackageCodes.PackageCode.Добавить(PackageCode);  
		КонецЦикла;
    КонецЕсли;    		

    PackageCodeGet.PackageCodes = PackageCodes;
	PackageCodeGet = обПолучитьВозвратWAError("http://wa.dms.webservice/PackageCodeGetRequest",PackageCodeGetRequest,PackageCodeGet,"1",ТаблицаОщибок);
	Возврат PackageCodeGet;  

КонецФункции
